In [1]:
import pandas as pd
import numpy as np

In [55]:
dados = {'Ano graduação': ['1º','2º','3º','4º', 'total'], 'Matriculas Março': [70,50,47,23,190], 'Matriculas Novembro': [65,48,40,22,175]}

In [56]:
dataset = pd.DataFrame(dados)

In [57]:
dataset

  Ano graduação  Matriculas Março  Matriculas Novembro
0            1º                70                   65
1            2º                50                   48
2            3º                47                   40
3            4º                23                   22
4         total               190                  175

In [58]:
dataset['Taxa de Evasão'] = (dataset['Matriculas Março']-dataset['Matriculas Novembro'])/(dataset['Matriculas Março']) * 100

In [59]:
dataset

  Ano graduação  Matriculas Março  Matriculas Novembro  Taxa de Evasão
0            1º                70                   65        7.142857
1            2º                50                   48        4.000000
2            3º                47                   40       14.893617
3            4º                23                   22        4.347826
4         total               190                  175        7.894737

Exemplo: A cada 100 alunos no 1º ano de graduação, 7 desistem do curso.